{"data":{"markdownRemark":{"html":"<p>Last summer, I had the opportunity to contribute to an awesome project by <a href=\"https://twitter.com/spoo0py\">Abbie Rappaport</a>, a Master's student at the University of Concordia in Montreal. Abbie is studying the esports community built around Super Smash Bros. Melee, an ancient title by competitive gaming standards with a deep, rich history. <a href=\"https://www.abbierappaport.com/games\">The project</a> brings together several different mediums to best introduce the uninitiated to what makes SSBM so special amongst gaming communities. I can't encourage you enough to follow through that project link and check it out for yourself!</p>\n<p>To quote the project link above, an overview of the project is:</p>\n<blockquote>\n<p>The work is a combination of writing, drawings and design elements that offers insight about this passionate community. This interdisciplinary work has been uploaded to a raspberry pi, housed in a handmade case, styled after the Nintendo Gamecube. The pi includes a program specific to the work, that allows one to navigate through the piece with a Gamecube controller, using the joystick to scroll and various buttons to zoom in and out. The piece is displayed on a CRT television. These two pieces of hardware are used unanimously in the SSBM community.</p>\n</blockquote>\n<p>In even simpler terms, it's a means of allowing viewers to simultaneously learn about <em>and experience</em> why SSBM is unique. It's so cool.</p>\n<p><img src=\"./cube-comparison.jpg\" alt=\"The project cube vs a real cube\"></p>\n<p>My role was to help bring the programming aspect of it to life. Here's a quick breakdown of key points:</p>\n<ul>\n<li>Composite video out. One of the most obvious distinguishing factors of SSBM is that it's still played on old CRT televisions, since the Gamecube was released in 2001 and serves video out through tri-color cables.</li>\n<li>USB controller input. The informational image being displayed is very high-res, so it's huge. As such, someone interacting with it will need to be able to scroll, pan, and zoom to see the entire thing. Fortunately, there are plenty of third-party USB Gamecube controller replicas.</li>\n<li>An image viewer! Something that can handle large resolutions and allows for all the functionality described in the previous bullet point; scrolling, panning, and zooming.</li>\n</ul>","frontmatter":{"date":"December, 31 2018","title":"USB controllers, Py, and Pi","author":"Webs"}}},"pageContext":{}}